"""
Напишіть функцію, яка приймає 2 списки. Результатом має бути новий список,
в якому знаходяться елементи першого списку, яких немає в другому.
Порядок елементів, що залишилися має відповідати порядку в першому (оригінальному) списку.
Реалізуйте обчислення за допомогою генератора.
    Приклад:
    array_diff([1, 2], [1]) --> [2]
    array_diff([1, 2, 2, 2, 4, 3, 4], [2]) --> [1, 4, 3, 4]
"""


def two_list(list_1, list_2):
    new_list = [i for i in list_1 if i not in list_2]
    return new_list


original_list = [1, 2, 2, 2, 4, 3, 4]
second_list = [2]
result = two_list(original_list, second_list)
print(result)
